## Prepare HR Database

Let us prepare HR database with **EMPLOYEES** Table. We will be using this for some of the examples as well as exercises related to Window Functions.

Let us start spark context for this Notebook so that we can execute the code provided. You can sign up for our [10 node state of the art cluster/labs](https://labs.itversity.com/plans) to learn Spark SQL using our unique integrated LMS.

In [1]:
val username = System.getProperty("user.name")

username = itv002480

itv002480

In [2]:
import org.apache.spark.sql.SparkSession

val username = System.getProperty("user.name")
val spark = SparkSession.
    builder.
    config("spark.ui.port", "0").
    config("spark.sql.warehouse.dir", s"/user/${username}/warehouse").
    enableHiveSupport.
    appName(s"${username} | Spark SQL - Windowing Functions").
    master("yarn").
    getOrCreate

username = itv002480
spark = org.apache.spark.sql.SparkSession@6cc70fd6

org.apache.spark.sql.SparkSession@6cc70fd6

If you are going to use CLIs, you can use Spark SQL using one of the 3 approaches.

**Using Spark SQL**

```
spark2-sql \
    --master yarn \
    --conf spark.ui.port=0 \
    --conf spark.sql.warehouse.dir=/user/${USER}/warehouse
```

**Using Scala**

```
spark2-shell \
    --master yarn \
    --conf spark.ui.port=0 \
    --conf spark.sql.warehouse.dir=/user/${USER}/warehouse
```

**Using Pyspark**

```
pyspark2 \
    --master yarn \
    --conf spark.ui.port=0 \
    --conf spark.sql.warehouse.dir=/user/${USER}/warehouse
```

* Create Database **itversity_hr** (replace itversity with your OS User Name)
* Create table **employees** in **itversity_hr** database.
* Load data into the table.

First let us start with creating the database.

In [3]:
%%sql

DROP DATABASE itv002480_hr CASCADE

Waiting for a Spark session to start...

Magic sql failed to execute with error:
org.apache.hadoop.hive.metastore.api.NoSuchObjectException: itv002480_hr;

In [4]:
%%sql

CREATE DATABASE itv002480_hr

++
||
++
++

In [5]:
%%sql

USE itv002480_hr

++
||
++
++

In [6]:
%%sql

SELECT current_database()

+------------------+
|current_database()|
+------------------+
|      itv002480_hr|
+------------------+

As the database is created, let us go ahead and add table to it.

In [7]:
%%sql

CREATE TABLE employees (
  employee_id     int,
  first_name      varchar(20),
  last_name       varchar(25),
  email           varchar(25),
  phone_number    varchar(20),
  hire_date       date,
  job_id          varchar(10),
  salary          decimal(8,2),
  commission_pct  decimal(2,2),
  manager_id      int,
  department_id   int
) ROW FORMAT DELIMITED FIELDS TERMINATED BY '\t'

++
||
++
++

Let us load the data and validate the table.

In [8]:
%%sql

LOAD DATA LOCAL INPATH '/data/hr_db/employees' 
INTO TABLE employees

++
||
++
++

In [9]:
%%sql

SELECT * FROM employees LIMIT 10

|        157|   Patrick|    Sully|  PSULLY|011.44.1345.929268|1996-...

+-----------+----------+---------+--------+------------------+----------+------+--------+--------------+----------+-------------+
|employee_id|first_name|last_name|   email|      phone_number| hire_date|job_id|  salary|commission_pct|manager_id|department_id|
+-----------+----------+---------+--------+------------------+----------+------+--------+--------------+----------+-------------+
|        155|    Oliver|  Tuvault|OTUVAULT|011.44.1344.486508|1999-11-23|SA_REP| 7000.00|          0.15|       145|           80|
|        156|   Janette|     King|   JKING|011.44.1345.429268|1996-01-30|SA_REP|10000.00|          0.35|       146|           80|
|        157|   Patrick|    Sully|  PSULLY|011.44.1345.929268|1996-03-04|SA_REP| 9500.00|          0.35|       146|           80|
|        158|     Allan|   McEwen| AMCEWEN|011.44.1345.829268|1996-08-01|SA_REP| 9000.00|          0.35|       146|           80|
|        159|   Lindsey|    Smith|  LSMITH|011.44.1345.729268|1997-03-10|SA_REP| 8000.00|          0.30|       146|           80|
|        160|    Louise|    Doran|  LDORAN|011.44.1345.629268|1997-12-15|SA_REP| 7500.00|          0.30|       146|           80|
|        161|    Sarath|   Sewall| SSEWALL|011.44.1345.529268|1998-11-03|SA_REP| 7000.00|          0.25|       146|           80|
|        162|     Clara|  Vishney|CVISHNEY|011.44.1346.129268|1997-11-11|SA_REP|10500.00|          0.25|       147|           80|
|        163|  Danielle|   Greene| DGREENE|011.44.1346.229268|1999-03-19|SA_REP| 9500.00|          0.15|       147|           80|
|        164|    Mattea|  Marvins|MMARVINS|011.44.1346.329268|2000-01-24|SA_REP| 7200.00|          0.10|       147|           80|
+-----------+----------+---------+--------+------------------+----------+------+--------+--------------+----------+-------------+

In [10]:
%%sql

SELECT employee_id, department_id, salary FROM employees LIMIT 10

+-----------+-------------+--------+
|employee_id|department_id|  salary|
+-----------+-------------+--------+
|        100|           90|24000.00|
|        101|           90|17000.00|
|        102|           90|17000.00|
|        103|           60| 9000.00|
|        104|           60| 6000.00|
|        105|           60| 4800.00|
|        106|           60| 4800.00|
|        107|           60| 4200.00|
|        108|          100|12000.00|
|        109|          100| 9000.00|
+-----------+-------------+--------+

In [11]:
%%sql

SELECT count(1) FROM employees

+--------+
|count(1)|
+--------+
|     107|
+--------+